# SERVERLESS CONNECTION (output as SQL output)

In [1]:
#If you haven't installed it already (either by using pip or by anaconda), run the following command in a Jupyter Notebook cell to install the extension
#!pip install ipython-sql (i have commented it out since we already downloaded ipython-sql from anaconda)

In [3]:
#In a Jupyter Notebook cell, load the %sql extension using the %load_ext magic command:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
#Use the %sql magic command to connect to your SQLite database. 
#Replace your_database.db with the actual path to your SQLite database file. 
#Use forward slashes (/) as path separators even on Windows:
#db_path="C:/Users/DELL/Documents/All%20Files/ALX Academy/Data%20Science/SQL/SQL%20Files/Extracted%20Module-3-SQL-a-3902/Module%203_%20SQL/Exercises/chinook.db"
#db_path = "C:/Users/DELL/Documents/All Files/ALX Academy/Data Science/SQL/SQL Files/Extracted Module-3-SQL-a-3902/Module 3_ SQL/Exercises/chinook.db"
#%sql sqlite:///C:/Users/DELL/Documents/All%20Files/ALX%20Academy/Data%20Science/SQL/SQL%20Files/ALX%20SQL%20Tutorial1/Module3_%20SQL/Exercises/chinook.db

%sql sqlite:///chinook.db

'Connected: @chinook.db'

In [6]:
#checking the table names in chinook database
#%sql SELECT name FROM sqlite_master WHERE type='table';

In [7]:
#You can now execute SQL commands using the %sql magic command. For example, to retrieve data from a table:
#%reload_ext sql
#%sql SELECT * FROM "employees";
%sql SELECT * FROM employees;

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com'),
 (6, 'Mitchell', 'Michael', 'IT Manager', 1, '1973-07-01 00:00:00', '2003-10-17 00:00:00', '5827 Bowness Road NW', 'Calgary', 'AB', 'Canada', 'T3B 0C5', '+1 (403) 246-9887', '+1 (403) 246-9899', 'michael@chinookcorp.com'),
 (7, 'King', 'Robert', 'IT Staff', 6, '1970-05-29 00:00:00', '2004-01-02 00:00:00', '590 Columbia Boulevard West', 'Lethbridge', 'AB', 'Canada', 'T1K 5N8', '+1 (403) 456-9986', '+1 (403) 456-8485', 'robert@chinookcorp.com'),
 (8, 'Callahan', 'Laura', 'IT Staff', 6, '1968-01-09 00:00:00', '2004-03-04 00:00:00', '923 7 ST NW', 'Lethbridge', 'AB', 'Canada', 'T1H 1Y8', '+1 (403) 467-3351', '+1 (403) 467-8772', 'laura@chinookcorp.com')]

In [8]:
%%sql

SELECT
    FirstName,
    LastName,
    HireDate
FROM
    employees;

 * sqlite:///chinook.db
Done.

[('Andrew', 'Adams', '2002-08-14 00:00:00'),
 ('Nancy', 'Edwards', '2002-05-01 00:00:00'),
 ('Jane', 'Peacock', '2002-04-01 00:00:00'),
 ('Margaret', 'Park', '2003-05-03 00:00:00'),
 ('Steve', 'Johnson', '2003-10-17 00:00:00'),
 ('Michael', 'Mitchell', '2003-10-17 00:00:00'),
 ('Robert', 'King', '2004-01-02 00:00:00'),
 ('Laura', 'Callahan', '2004-03-04 00:00:00')]